Repository: getfem-doc/getfem-doc-translations
Catalog: doc/sphinx/source/locale/*/LC_MESSAGES/about.po
Languages: ja, pt_br

source: About these documents
ja: これらのドキュメントについて
pt_br: Sobre a documentação

source: These documents are generated from `reStructuredText <http://docutils.sourceforge.net/rst.html>`_ sources by *Sphinx*, a document processor specifically written for the Python documentation.
ja: これらのドキュメントは以下のテキストが元になっています。reStructuredText <http://docutils.sourceforge.net/rst.html>` -pythonでの文書化用ツール"スフィンクス"で作成-
pt_br: Esses documentos são gerados de arquivos `reStructuredText <http://docutils.sourceforge.net/rst.html>`_ pelo *Sphinx*, um processador de documentos escrito especialmente para a documentação do Python.

source: In the online version of these documents, you can submit comments and suggest changes directly on the documentation pages.
ja: これらのドキュメントのオンライン版では、利用者がコメントを投稿したり、ドキュメントのページで直接、変更を提案することができます。
pt_br: Na versão online dessa documentação, você pode submeter comentários e sugerir mudanças diretamente nas páginas de documentação.

source: Development of the documentation and its toolchain takes place on the getfem-users@nongnu.org mailing list (see `getfem mailing lists <https://savannah.nongnu.org/mail/?group=getfem>`_ . We're always looking for volunteers wanting to help with the docs, so feel free to send a mail there!
ja: ドキュメントの更新とそのツールチェーンは以下のメーリングリストで行われます。 getfem-users@nongnu.org（こちらをご参照ください。 `getfem mailing lists <https://savannah.nongnu.org/mail/?group=getfem>`_。文書について力を貸してくださるボランティアを常に募集しています。お気軽にこちらにメールしてください。
pt_br: O desenvolvimento da documentação e as ferramentas usadas estão na lista de email getfem-users@nongnu.org (veja `getfem mailing lists <https://savannah.nongnu.org/mail/?group=getfem>`_ . Nós estamos sempre procurando por voluntários para ajudar com a documentação, portanto sinta-se à vontade de mandar uma mensagem lá!

source: Many thanks go to:
ja: 謝辞：
pt_br: Muitos agradecimentos vão para:

source: Fred L. Drake, Jr., the creator of the original Python documentation toolset and writer of much of the content;
ja: Fred L. Drake, Jr. 元々のPythonドキュメント化ツールセットの制作者であり、コンテンツの多くの執筆者。
pt_br: Fred L. Drake, Jr., o criador da documentação original do ferramental Python e escritor de muito do conteúdo;

source: The `Docutils <http://docutils.sourceforge.net/>`_ project for creating reStructuredText and the Docutils suite;
ja: reStructuredTextとDocutilsスイートを作成するためのプロジェクト _`Docutils <http://docutils.sourceforge.net/>`
pt_br: O projeto `Docutils <http://docutils.sourceforge.net/>`_ por criar o reStructuredText e a suíte Docutils;

source: Fredrik Lundh for his `Alternative Python Reference <http://effbot.org/zone/pyref.htm>`_ project from which Sphinx got many good ideas.
ja: Fredrik Lundh-彼のプロジェクト `Alternative Python Reference <http://effbot.org/zone/pyref.htm>` からSphinxは多くの良いアイディアを得ました。
pt_br: Fredrik Lundh pelo seu projeto `Alternative Python Reference <http://effbot.org/zone/pyref.htm>`_ do qual o Spinx tirou muitas boas ideias.

source: See :ref:`reporting-bugs` for information how to report bugs in GetFEM++ itself.
ja: GetFEM ++自体のバグを報告する方法については：ref： `reporting-bugs`を参照してください。

source: Contributors to the GetFEM++ Documentation
ja: GetFEM ++ドキュメントへの貢献者

source: This section lists people who have contributed in some way to the GetFEM++ documentation. It is probably not complete -- if you feel that you or anyone else should be on this list, please let us know (send email to getfem-users@nongnu.org), and we'll be glad to correct the problem.
ja: このセクションは何らかの方法でGetFEM ++ドキュメントに貢献した人々をリストします。それはおそらく完全ではありません - あなたがあなたや他の誰かがこのリストに載っているべきだと思うならば、私達に知らせてください（getfem-users@nongnu.orgに電子メールを送ってください）。私たちは問題を修正できてうれしく思うでしょう。

source: Luis Saavedra
ja: ルイス・サアベドラ

source: Julien Pommier
ja: ジュリアン・ポミエ

source: Konstantinos Poulios
ja: コンスタンティノス・プリオス

source: Yves Renard
ja: イヴ・レナード

source: It is only with the input and contributions of the GetFEM++ community that GetFEM++ has such wonderful documentation -- Thank You!
ja: GetFEM ++がすばらしいドキュメンテーションを持っているのは、GetFEM ++コミュニティの意見と貢献のおかげです - ありがとう！

source: See :ref:`reporting-bugs` for information how to report bugs in GetFEM itself.
pt_br: Veja :ref:`reporting-bugs` por informações sobre como reportar bugs no GetFEM em si.

source: Contributors to the GetFEM Documentation
pt_br: Contribuidores para a documentação do GetFEM

source: This section lists people who have contributed in some way to the GetFEM documentation. It is probably not complete -- if you feel that you or anyone else should be on this list, please let us know (send email to getfem-users@nongnu.org), and we'll be glad to correct the problem.
pt_br: Essa seção lista pessoas que contribuíram de alguma forma para a documentação do GetFEM. Ela provavelmente não está completa -- se você acha que você ou qualquer outra pessoa deveria estar nessa lista, por favor nos avise (mande um email para getfem-users@nongnu.org) e nós ficaremos felizes em corrigir o problema.

source: It is only with the input and contributions of the GetFEM community that GetFEM has such wonderful documentation -- Thank You!
pt_br: É apenas com o input e as contribuições da comunidade do GetFEM que o GetFEM tem uma documentação tão boa -- Obrigado!
