Repository: getfem-doc/getfem-doc-translations
Catalog: doc/sphinx/source/locale/*/LC_MESSAGES/bugs.po
Languages: ja, pt_br

source: Reporting Bugs in GetFEM++
ja: GetFEM ++でのバグ報告

source: Bug reports should be submitted via the Savannah Bug Tracker (in https://savannah.nongnu.org/projects/getfem). The bug tracker offers a Web form which allows pertinent information to be entered and submitted to the developers.
ja: バグ報告はSavannah Bug Tracker（ https://savannah.nongnu.org/projects/getfem ）で提出してください。バグトラッカーは、適切な情報を入力して開発者に送信することを可能にするWebフォームを提供します。
pt_br: Bugs devem ser submetidos através do Savannah Bug Tracker (em https://savannah.nongnu.org/projects/getfem). O bug tracker oferece um formulário on-line que permite a coleta e submissão das informações pertinentes para os desenvolvedores.

source: The first step in filing a report is to determine whether the problem has already been reported. The advantage in doing so, aside from saving the developers time, is that you learn what has been done to fix it; it may be that the problem has already been fixed for the next release, or additional information is needed (in which case you are welcome to provide it if you can!). To do this, search the bug database using the search box on the top of the page.
ja: 報告を提出する最初のステップは、問題がすでに報告されているかどうかを判断することです。開発者の時間を節約することを除いて、そうすることの利点は、あなたがそれを修正するために行われたことを知るということです。次のリリースで問題がすでに修正されているか、追加情報が必要である可能性があります（その場合は、可能であれば提供してください）。これを行うには、ページ上部の検索ボックスを使用してバグデータベースを検索してください。
pt_br: O primeiro passo na hora de preencher uma notificação de bug é determinar se o problema já foi notificado. A vantagem de fazer isso, além de economizar tempo dos desenvolvedores, é que você aprende o que já foi feito para corrigir; pode ser que o problema já foi corrigido na próxima versão, ou que mais informações são necessárias (nesse caso, por favor ajude caso você consiga!). Para fazer isso, busque na base de dados de bugs usando a caixa de busca no topo da página.

source: If the problem you're reporting is not already in the bug tracker, go back to the Savannah Bug Tracker. If you don't already have a tracker account, select the "New User" link in the sidebar and undergo the registration procedure. Otherwise, if you're not logged in, select "Login" and enter your credentials. It is not possible to submit a bug report anonymously.
ja: 報告している問題がまだバグトラッカーにない場合は、Savannah Bug Trackerに戻ってください。まだトラッカーアカウントをお持ちでない場合は、サイドバーの[新規ユーザー]リンクを選択して登録手続きを行ってください。ログインしていない場合は、[ログイン]を選択して認証情報を入力してください。バグレポートを匿名で送信することはできません。
pt_br: Se o problema que você está reportando ainda não está no bug tracker, volte para o Savannah Bug Tracker. Se você ainda não tiver uma conta, clique no link "New User" na barra lateral e faça seu registro. Caso contrário, se seu usuário não estiver logado, clique em "Login" e digite suas credenciais. Não é possível submeter um bug anonimamente.

source: Being now logged in, you can submit a bug. Go to https://savannah.nongnu.org/projects/getfem and select the "Submit a new item" link (in the "Bug Tracker" table) to open the bug reporting form.
ja: ログインしたら、バグを投稿することができます。 https://savannah.nongnu.org/projects/getfemにアクセスし、（ "Bug Tracker"テーブル内の） "Submit a new item"リンクを選択してバグ報告フォームを開いてください。
pt_br: Com o login feito, você pode agora submeter um bug. Vá em https://savannah.nongnu.org/projects/getfem e clique em "Submit a new item" (na tabela "Bug Tracker") para abrir o formulário de submissão.

source: The submission form has a number of fields. For the "Summary" field, enter a *very* short description of the problem; less than ten words is good. In the "Severity" field, select the severity of your problem; also select the "Privacy" and "Category" to which the bug relates.
ja: 信フォームにはいくつかのフィールドがあります。 [概要]フィールドに、問題の*非常に*短い説明を入力します。 10語未満が良いです。 [重大度]フィールドで、問題の重大度を選択します。バグが関連する「プライバシー」と「カテゴリ」も選択します。
pt_br: O formulário de submissão tem vários campos. Em "Summary", coloque uma descrição *bem* curta do problema; menos do que dez palavras é bom. No campo "Severity", selecione a severidade do seu problema; selecione também a "Privacy" e "Category" indicando, respectivamente, o nível de privacidade e a categoria do bug.

source: In the "Original Submission" field, describe the problem in detail, including what you expected to happen and what did happen. Be sure to include whether any extension modules were involved, and what hardware and software platform you were using (including version information as appropriate).
ja: [元の投稿]フィールドに、あなたが何を予想していたのか、何が起こったのかなど、問題を詳細に説明してください。拡張モジュールが含まれていたかどうか、および使用しているハードウェアとソフトウェアのプラットフォーム（必要に応じてバージョン情報を含む）を必ず含めてください。
pt_br: No campo "Original Submission", descreva o problema em detalhes, incluindo o que você esperava que acontecesse e o que de fato aconteceu. Inclua informações se um módulo de extensão estava envolvido e qual plataforma de software e hardware você estava usando (incluindo informações das versões conforme apropriado)

source: Each bug report will be assigned to a developer who will determine what needs to be done to correct the problem. You will receive an update each time action is taken on the bug.
ja: 各バグレポートは開発者に割り当てられ、開発者は問題を解決するために何をする必要があるかを判断します。あなたはバグに対して行動が取られるたびに更新を受け取ります。
pt_br: Cada bug report vai ser atribuído para uma pessoa da equipe de desenvolvimento que irá determinar o que precisa ser feito para corrigir o problema. Você ira receber uma atualização cada vez que uma ação for tomada com relação ao bug.

source: `How to Report Bugs Effectively <http://www.chiark.greenend.org.uk/~sgtatham/bugs.html>`_ Article which goes into some detail about how to create a useful bug report. This describes what kind of information is useful and why it is useful.
ja: `バグを効果的に報告する方法<http://www.chiark.greenend.org.uk/~sgtatham/bugs.html>` _有用なバグレポートを作成する方法についての詳細な記事。これは、どのような種類の情報が有用で、なぜ有用なのかを説明しています。
pt_br: O artigo `How to Report Bugs Effectively <http://www.chiark.greenend.org.uk/~sgtatham/bugs.html>`_ inclui alguns detalhes sobre como criar um bug report útil. Ele descreve as informações que são necessárias e porquê elas são importantes.

source: `Bug Writing Guidelines <https://developer.mozilla.org/en/Bug_writing_guidelines>`_ Information about writing a good bug report. Some of this is specific to the Mozilla project, but describes general good practices.
ja: `バグ作成ガイドライン<https://developer.mozilla.org/en/Bug_writing_guidelines>` _良いバグレポートの作成に関する情報。これのいくつかはMozillaプロジェクトに固有のものですが、一般的な良い方法を説明しています。
pt_br: `Bug Writing Guidelines <https://developer.mozilla.org/en/Bug_writing_guidelines>`_ oferece informações sobre como escrever um bom bug report. Algumas coisas podem ser específicas aos projetos da Mozilla, mas ele descreve também boas práticas gerais.

source: Reporting Bugs in GetFEM
pt_br: Reportando Bugs no GetFEM
